In [1]:
import numpy as np
import pandas as pd

In [4]:
merge = pd.read_csv("delay.csv")

In [5]:
merge.head()

                 station  week  month  month_3  month_6  year  train_number
0  LOKMANYATILAK T (LTT)     2      2        2        2     2          1035
1        KALYAN JN (KYN)    27     27       27       27    27          1035
2        NASIK ROAD (NK)    22     22       22       22    22          1035
3      BHUSAVAL JN (BSL)    14     14       14       14    14          1035
4          KHANDWA (KNW)    34     34       34       34    34          1035

In [6]:
train = pd.read_csv("webapp/data.csv")

In [7]:
train.head()

,third_ac,arrival,from_station_code,name,zone,chair_car,first_class,sleeper,from_station_name,number,departure,return_train,to_station_code,second_ac,classes,to_station_name,type,first_ac,distance,duration
0,0,12:15:00,JAT,Jammu Tawi Udhampur Special,NR,0,0,0,JAMMU TAWI,04601,10:40:00,04602,UHP,0,NaN,UDHAMPUR,DEMU,0,53.0,1.583333
1,0,08:35:00,UHP,UDHAMPUR JAMMUTAWI DMU,NR,0,0,0,UDHAMPUR,04602,06:45:00,04601,JAT,0,NaN,JAMMU TAWI,DEMU,0,53.0,1.833333
2,0,17:50:00,JAT,JAT UDAHMPUR DMU,NR,0,0,0,JAMMU TAWI,04603,16:15:00,04604,UHP,0,NaN,UDHAMPUR,DEMU,0,53.0,1.583333
3,0,19:50:00,UHP,UDHAMPUR JAMMUTAWI DMU,NR,0,0,0,UDHAMPUR,04604,18:20:00,04603,JAT,0,NaN,JAMMU TAWI,DEMU,0,53.0,1.500000
4,1,12:30:00,BDTS,Mumbai BandraT-Bikaner SF Special,NWR,0,0,1,MUMBAI BANDRA TERMINUS,04728,14:35:00,04727,BKN,1,NaN,BIKANER JN,SF,0,1212.0,21.916667

In [22]:
mt = set(merge["station"])

In [27]:
import re

In [29]:
exp = re.compile("\((?P<code>[A-Za-z]*)\)")

In [30]:
mt_new = set()
for it in mt:
    mt_new.add(exp.search(it).group("code"))

In [33]:
tt = set(train["from_station_code"])

In [34]:
pos = 0
neg = 0

In [35]:
for tr in tt:
    try:
        if tr in mt_new:
            pos += 1
        else:
            neg += 1
    except:
        neg += 1

In [36]:
pos, neg

(499, 165)

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("railway/data/geo.csv")

In [ ]:
# df[df["code"]=="DADN"].iloc[0,[1,2]] = 22.5558,75.7707

In [5]:
df[df["code"] == "VGLJ"]

    code                         name  latitude  longitude
23  VGLJ  Virangana Lakshmibai Jhansi   25.4444    78.5535

In [5]:
df.iloc[23, [1, 2, 3]] = "Virangana Lakshmibai Jhansi", 25.4444, 78.5535

In [7]:
df.to_csv("railway/data/geo.csv", index=False)